# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [75]:
# 記得先 Import 正確的套件

import numpy as np
import pandas as pd

In [91]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [92]:
# - 計算每個不同種類 animal 的 age 的平均數
# - 計算每個不同種類 animal 的 age 的平均數
# - 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
# - 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False

print(df.groupby('animal').age.mean())
print('--')
print(df.sort_values(['age', 'visits'], ascending = False))
print('--')
df['priority'] = df['priority'] == 'yes'
df

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64
--
  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
b    cat  3.0       3      yes
j    dog  3.0       1       no
a    cat  2.5       1      yes
f    cat  2.0       3       no
c  snake  0.5       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes
--

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  2.0       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [60]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.675170  0.129350  0.159064
1  0.025937  0.555799  0.913154
2  0.691443  0.479652  0.593358
3  0.656708  0.643526  0.854147
4  0.460189  0.914898  0.312745

In [61]:
print(df.mean())
print(df - df.mean())

0    0.501889
1    0.544645
2    0.566494
dtype: float64
          0         1         2
0  0.173280 -0.415295 -0.407430
1 -0.475953  0.011154  0.346660
2  0.189554 -0.064993  0.026864
3  0.154819  0.098881  0.287654
4 -0.041700  0.370253 -0.253749

In [62]:
df.sub(df.mean(1))

          0         1         2   3   4
0  0.353975 -0.368947 -0.429087 NaN NaN
1 -0.295258  0.057502  0.325003 NaN NaN
2  0.370248 -0.018644  0.005207 NaN NaN
3  0.335514  0.145230  0.265996 NaN NaN
4  0.138995  0.416601 -0.275406 NaN NaN

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [63]:
df

          0         1         2
0  0.675170  0.129350  0.159064
1  0.025937  0.555799  0.913154
2  0.691443  0.479652  0.593358
3  0.656708  0.643526  0.854147
4  0.460189  0.914898  0.312745

In [72]:
print(df.sum(1))
df.sum(1).argmin()

0    0.963584
1    1.494889
2    1.764453
3    2.154382
4    1.687832
dtype: float64

0

In [73]:
print(df.sum())
df.sum().argmin()

0    2.509447
1    2.723225
2    2.832468
dtype: float64

0